; domain
(define (domain sokoban)
  (:requirements :typing :action-costs)
  (:types thing location direction - object
          player stone - thing)
  (:predicates (clear ?l - location)
	       (at ?t - thing ?l - location)
	       (at-goal ?s - stone)
	       (IS-GOAL ?l - location)
	       (IS-NONGOAL ?l - location)
               (MOVE-DIR ?from ?to - location ?dir - direction))
  

  (:action move
   :parameters (?p - player ?from ?to - location ?dir - direction)
   :precondition (and (at ?p ?from)
                      (clear ?to)
                      (MOVE-DIR ?from ?to ?dir)
                      )
   :effect       (and (not (at ?p ?from))
                      (not (clear ?to))
                      (at ?p ?to)
                      (clear ?from)
                      )
   )

  (:action push-to-nongoal
   :parameters (?p - player ?s - stone
                ?ppos ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?ppos)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?ppos ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-NONGOAL ?to)
                      )
   :effect       (and (not (at ?p ?ppos))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?ppos)
                      (not (at-goal ?s))
                      )
   )

  (:action push-to-goal
   :parameters (?p - player ?s - stone
                ?ppos ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?ppos)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?ppos ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-GOAL ?to)
                      )
   :effect       (and (not (at ?p ?ppos))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?ppos)
                      (at-goal ?s)
                      )
   )
)

; problem
;; "svenx008"
;;
;;       # #
;;    # #   #
;;   #     #
;;    # . . #
;;   #   .   #
;;  #   $ $ $ #
;;   # # # *   #
;;      # @ @ #
;;       # # #

(define (problem p008-hexoban-temporal)
  (:domain sokoban)
  (:objects
    dir-east - direction
    dir-northeast - direction
    dir-northwest - direction
    dir-southeast - direction
    dir-southwest - direction
    dir-west - direction
    player-01 - player
    player-02 - player
    pos-01-01 - location
    pos-01-03 - location
    pos-01-05 - location
    pos-01-07 - location
    pos-01-09 - location
    pos-02-02 - location
    pos-02-04 - location
    pos-02-06 - location
    pos-02-08 - location
    pos-03-01 - location
    pos-03-03 - location
    pos-03-05 - location
    pos-03-07 - location
    pos-03-09 - location
    pos-04-02 - location
    pos-04-04 - location
    pos-04-06 - location
    pos-04-08 - location
    pos-05-01 - location
    pos-05-03 - location
    pos-05-05 - location
    pos-05-07 - location
    pos-05-09 - location
    pos-06-02 - location
    pos-06-04 - location
    pos-06-06 - location
    pos-06-08 - location
    pos-07-01 - location
    pos-07-03 - location
    pos-07-05 - location
    pos-07-07 - location
    pos-07-09 - location
    pos-08-02 - location
    pos-08-04 - location
    pos-08-06 - location
    pos-08-08 - location
    pos-09-01 - location
    pos-09-03 - location
    pos-09-05 - location
    pos-09-07 - location
    pos-09-09 - location
    pos-10-02 - location
    pos-10-04 - location
    pos-10-06 - location
    pos-10-08 - location
    pos-11-01 - location
    pos-11-03 - location
    pos-11-05 - location
    pos-11-07 - location
    pos-11-09 - location
    pos-12-02 - location
    pos-12-04 - location
    pos-12-06 - location
    pos-12-08 - location
    pos-13-01 - location
    pos-13-03 - location
    pos-13-05 - location
    pos-13-07 - location
    pos-13-09 - location
    stone-01 - stone
    stone-02 - stone
    stone-03 - stone
    stone-04 - stone
  )
  (:init
    (IS-GOAL pos-06-04)
    (IS-GOAL pos-07-05)
    (IS-GOAL pos-08-04)
    (IS-GOAL pos-09-07)
    (IS-NONGOAL pos-01-01)
    (IS-NONGOAL pos-01-03)
    (IS-NONGOAL pos-01-05)
    (IS-NONGOAL pos-01-07)
    (IS-NONGOAL pos-01-09)
    (IS-NONGOAL pos-02-02)
    (IS-NONGOAL pos-02-04)
    (IS-NONGOAL pos-02-06)
    (IS-NONGOAL pos-02-08)
    (IS-NONGOAL pos-03-01)
    (IS-NONGOAL pos-03-03)
    (IS-NONGOAL pos-03-05)
    (IS-NONGOAL pos-03-07)
    (IS-NONGOAL pos-03-09)
    (IS-NONGOAL pos-04-02)
    (IS-NONGOAL pos-04-04)
    (IS-NONGOAL pos-04-06)
    (IS-NONGOAL pos-04-08)
    (IS-NONGOAL pos-05-01)
    (IS-NONGOAL pos-05-03)
    (IS-NONGOAL pos-05-05)
    (IS-NONGOAL pos-05-07)
    (IS-NONGOAL pos-05-09)
    (IS-NONGOAL pos-06-02)
    (IS-NONGOAL pos-06-06)
    (IS-NONGOAL pos-06-08)
    (IS-NONGOAL pos-07-01)
    (IS-NONGOAL pos-07-03)
    (IS-NONGOAL pos-07-07)
    (IS-NONGOAL pos-07-09)
    (IS-NONGOAL pos-08-02)
    (IS-NONGOAL pos-08-06)
    (IS-NONGOAL pos-08-08)
    (IS-NONGOAL pos-09-01)
    (IS-NONGOAL pos-09-03)
    (IS-NONGOAL pos-09-05)
    (IS-NONGOAL pos-09-09)
    (IS-NONGOAL pos-10-02)
    (IS-NONGOAL pos-10-04)
    (IS-NONGOAL pos-10-06)
    (IS-NONGOAL pos-10-08)
    (IS-NONGOAL pos-11-01)
    (IS-NONGOAL pos-11-03)
    (IS-NONGOAL pos-11-05)
    (IS-NONGOAL pos-11-07)
    (IS-NONGOAL pos-11-09)
    (IS-NONGOAL pos-12-02)
    (IS-NONGOAL pos-12-04)
    (IS-NONGOAL pos-12-06)
    (IS-NONGOAL pos-12-08)
    (IS-NONGOAL pos-13-01)
    (IS-NONGOAL pos-13-03)
    (IS-NONGOAL pos-13-05)
    (IS-NONGOAL pos-13-07)
    (IS-NONGOAL pos-13-09)
    (MOVE-DIR pos-01-01 pos-02-02 dir-southeast)
    (MOVE-DIR pos-01-01 pos-03-01 dir-east)
    (MOVE-DIR pos-01-03 pos-02-02 dir-northeast)
    (MOVE-DIR pos-01-03 pos-02-04 dir-southeast)
    (MOVE-DIR pos-01-05 pos-02-04 dir-northeast)
    (MOVE-DIR pos-01-07 pos-02-08 dir-southeast)
    (MOVE-DIR pos-01-09 pos-02-08 dir-northeast)
    (MOVE-DIR pos-01-09 pos-03-09 dir-east)
    (MOVE-DIR pos-02-02 pos-01-01 dir-northwest)
    (MOVE-DIR pos-02-02 pos-01-03 dir-southwest)
    (MOVE-DIR pos-02-02 pos-03-01 dir-northeast)
    (MOVE-DIR pos-02-04 pos-01-03 dir-northwest)
    (MOVE-DIR pos-02-04 pos-01-05 dir-southwest)
    (MOVE-DIR pos-02-08 pos-01-07 dir-northwest)
    (MOVE-DIR pos-02-08 pos-01-09 dir-southwest)
    (MOVE-DIR pos-02-08 pos-03-09 dir-southeast)
    (MOVE-DIR pos-02-08 pos-04-08 dir-east)
    (MOVE-DIR pos-03-01 pos-01-01 dir-west)
    (MOVE-DIR pos-03-01 pos-02-02 dir-southwest)
    (MOVE-DIR pos-03-01 pos-05-01 dir-east)
    (MOVE-DIR pos-03-09 pos-01-09 dir-west)
    (MOVE-DIR pos-03-09 pos-02-08 dir-northwest)
    (MOVE-DIR pos-03-09 pos-04-08 dir-northeast)
    (MOVE-DIR pos-03-09 pos-05-09 dir-east)
    (MOVE-DIR pos-04-06 pos-05-05 dir-northeast)
    (MOVE-DIR pos-04-06 pos-06-06 dir-east)
    (MOVE-DIR pos-04-08 pos-02-08 dir-west)
    (MOVE-DIR pos-04-08 pos-03-09 dir-southwest)
    (MOVE-DIR pos-04-08 pos-05-09 dir-southeast)
    (MOVE-DIR pos-05-01 pos-03-01 dir-west)
    (MOVE-DIR pos-05-03 pos-06-04 dir-southeast)
    (MOVE-DIR pos-05-03 pos-07-03 dir-east)
    (MOVE-DIR pos-05-05 pos-04-06 dir-southwest)
    (MOVE-DIR pos-05-05 pos-06-04 dir-northeast)
    (MOVE-DIR pos-05-05 pos-06-06 dir-southeast)
    (MOVE-DIR pos-05-05 pos-07-05 dir-east)
    (MOVE-DIR pos-05-09 pos-03-09 dir-west)
    (MOVE-DIR pos-05-09 pos-04-08 dir-northwest)
    (MOVE-DIR pos-06-04 pos-05-03 dir-northwest)
    (MOVE-DIR pos-06-04 pos-05-05 dir-southwest)
    (MOVE-DIR pos-06-04 pos-07-03 dir-northeast)
    (MOVE-DIR pos-06-04 pos-07-05 dir-southeast)
    (MOVE-DIR pos-06-04 pos-08-04 dir-east)
    (MOVE-DIR pos-06-06 pos-04-06 dir-west)
    (MOVE-DIR pos-06-06 pos-05-05 dir-northwest)
    (MOVE-DIR pos-06-06 pos-07-05 dir-northeast)
    (MOVE-DIR pos-06-06 pos-08-06 dir-east)
    (MOVE-DIR pos-07-03 pos-05-03 dir-west)
    (MOVE-DIR pos-07-03 pos-06-04 dir-southwest)
    (MOVE-DIR pos-07-03 pos-08-02 dir-northeast)
    (MOVE-DIR pos-07-03 pos-08-04 dir-southeast)
    (MOVE-DIR pos-07-05 pos-05-05 dir-west)
    (MOVE-DIR pos-07-05 pos-06-04 dir-northwest)
    (MOVE-DIR pos-07-05 pos-06-06 dir-southwest)
    (MOVE-DIR pos-07-05 pos-08-04 dir-northeast)
    (MOVE-DIR pos-07-05 pos-08-06 dir-southeast)
    (MOVE-DIR pos-07-05 pos-09-05 dir-east)
    (MOVE-DIR pos-08-02 pos-07-03 dir-southwest)
    (MOVE-DIR pos-08-04 pos-06-04 dir-west)
    (MOVE-DIR pos-08-04 pos-07-03 dir-northwest)
    (MOVE-DIR pos-08-04 pos-07-05 dir-southwest)
    (MOVE-DIR pos-08-04 pos-09-05 dir-southeast)
    (MOVE-DIR pos-08-06 pos-06-06 dir-west)
    (MOVE-DIR pos-08-06 pos-07-05 dir-northwest)
    (MOVE-DIR pos-08-06 pos-09-05 dir-northeast)
    (MOVE-DIR pos-08-06 pos-09-07 dir-southeast)
    (MOVE-DIR pos-08-06 pos-10-06 dir-east)
    (MOVE-DIR pos-08-08 pos-09-07 dir-northeast)
    (MOVE-DIR pos-08-08 pos-10-08 dir-east)
    (MOVE-DIR pos-09-05 pos-07-05 dir-west)
    (MOVE-DIR pos-09-05 pos-08-04 dir-northwest)
    (MOVE-DIR pos-09-05 pos-08-06 dir-southwest)
    (MOVE-DIR pos-09-05 pos-10-06 dir-southeast)
    (MOVE-DIR pos-09-07 pos-08-06 dir-northwest)
    (MOVE-DIR pos-09-07 pos-08-08 dir-southwest)
    (MOVE-DIR pos-09-07 pos-10-06 dir-northeast)
    (MOVE-DIR pos-09-07 pos-10-08 dir-southeast)
    (MOVE-DIR pos-09-07 pos-11-07 dir-east)
    (MOVE-DIR pos-10-06 pos-08-06 dir-west)
    (MOVE-DIR pos-10-06 pos-09-05 dir-northwest)
    (MOVE-DIR pos-10-06 pos-09-07 dir-southwest)
    (MOVE-DIR pos-10-06 pos-11-07 dir-southeast)
    (MOVE-DIR pos-10-08 pos-08-08 dir-west)
    (MOVE-DIR pos-10-08 pos-09-07 dir-northwest)
    (MOVE-DIR pos-10-08 pos-11-07 dir-northeast)
    (MOVE-DIR pos-11-01 pos-12-02 dir-southeast)
    (MOVE-DIR pos-11-01 pos-13-01 dir-east)
    (MOVE-DIR pos-11-03 pos-12-02 dir-northeast)
    (MOVE-DIR pos-11-03 pos-12-04 dir-southeast)
    (MOVE-DIR pos-11-03 pos-13-03 dir-east)
    (MOVE-DIR pos-11-07 pos-09-07 dir-west)
    (MOVE-DIR pos-11-07 pos-10-06 dir-northwest)
    (MOVE-DIR pos-11-07 pos-10-08 dir-southwest)
    (MOVE-DIR pos-12-02 pos-11-01 dir-northwest)
    (MOVE-DIR pos-12-02 pos-11-03 dir-southwest)
    (MOVE-DIR pos-12-02 pos-13-01 dir-northeast)
    (MOVE-DIR pos-12-02 pos-13-03 dir-southeast)
    (MOVE-DIR pos-12-04 pos-11-03 dir-northwest)
    (MOVE-DIR pos-12-04 pos-13-03 dir-northeast)
    (MOVE-DIR pos-12-04 pos-13-05 dir-southeast)
    (MOVE-DIR pos-13-01 pos-11-01 dir-west)
    (MOVE-DIR pos-13-01 pos-12-02 dir-southwest)
    (MOVE-DIR pos-13-03 pos-11-03 dir-west)
    (MOVE-DIR pos-13-03 pos-12-02 dir-northwest)
    (MOVE-DIR pos-13-03 pos-12-04 dir-southwest)
    (MOVE-DIR pos-13-05 pos-12-04 dir-northwest)
    (at player-01 pos-08-08)
    (at player-02 pos-10-08)
    (at stone-01 pos-06-06)
    (at stone-02 pos-08-06)
    (at stone-03 pos-10-06)
    (at stone-04 pos-09-07)
    (at-goal stone-04)
    (clear pos-01-01)
    (clear pos-01-03)
    (clear pos-01-05)
    (clear pos-01-07)
    (clear pos-01-09)
    (clear pos-02-02)
    (clear pos-02-04)
    (clear pos-02-08)
    (clear pos-03-01)
    (clear pos-03-09)
    (clear pos-04-06)
    (clear pos-04-08)
    (clear pos-05-01)
    (clear pos-05-03)
    (clear pos-05-05)
    (clear pos-05-09)
    (clear pos-06-04)
    (clear pos-07-03)
    (clear pos-07-05)
    (clear pos-08-02)
    (clear pos-08-04)
    (clear pos-09-05)
    (clear pos-11-01)
    (clear pos-11-03)
    (clear pos-11-07)
    (clear pos-12-02)
    (clear pos-12-04)
    (clear pos-13-01)
    (clear pos-13-03)
    (clear pos-13-05)
    (clear pos-13-09)
  )
  (:goal (and
    (at-goal stone-01)
    (at-goal stone-02)
    (at-goal stone-03)
    (at-goal stone-04)
  ))
  
)

; plan
1. (move player-02 pos-10-08 pos-11-07 dir-northeast)
   deleted: (at player-02 pos-10-08) (clear pos-11-07)
   added: (at player-02 pos-11-07) (clear pos-10-08)
   goals met: 1 of 4
2. (push-to-nongoal player-02 stone-03 pos-11-07 pos-10-06 pos-09-05 dir-northwest)
   deleted: (at player-02 pos-11-07) (at stone-03 pos-10-06) (clear pos-09-05)
   added: (at player-02 pos-10-06) (at stone-03 pos-09-05) (clear pos-11-07)
   goals met: 1 of 4
3. (push-to-goal player-02 stone-03 pos-10-06 pos-09-05 pos-08-04 dir-northwest)
   deleted: (at player-02 pos-10-06) (at stone-03 pos-09-05) (clear pos-08-04)
   added: (at player-02 pos-09-05) (at stone-03 pos-08-04) (clear pos-10-06) (at-goal stone-03)
   goals met: 2 of 4
4. (move player-02 pos-09-05 pos-07-05 dir-west)
   deleted: (at player-02 pos-09-05) (clear pos-07-05)
   added: (at player-02 pos-07-05) (clear pos-09-05)
   goals met: 2 of 4
5. (move player-02 pos-07-05 pos-06-04 dir-northwest)
   deleted: (at player-02 pos-07-05) (clear pos-06-04)
   added: (at player-02 pos-06-04) (clear pos-07-05)
   goals met: 2 of 4
6. (move player-02 pos-06-04 pos-07-03 dir-northeast)
   deleted: (at player-02 pos-06-04) (clear pos-07-03)
   added: (at player-02 pos-07-03) (clear pos-06-04)
   goals met: 2 of 4
7. (move player-02 pos-07-03 pos-08-02 dir-northeast)
   deleted: (at player-02 pos-07-03) (clear pos-08-02)
   added: (at player-02 pos-08-02) (clear pos-07-03)
   goals met: 2 of 4
8. (push-to-nongoal player-01 stone-04 pos-08-08 pos-09-07 pos-10-06 dir-northeast)
   deleted: (at player-01 pos-08-08) (at stone-04 pos-09-07) (clear pos-10-06) (at-goal stone-04)
   added: (at player-01 pos-09-07) (at stone-04 pos-10-06) (clear pos-08-08)
   goals met: 1 of 4
9. (push-to-goal player-01 stone-02 pos-09-07 pos-08-06 pos-07-05 dir-northwest)
   deleted: (at player-01 pos-09-07) (at stone-02 pos-08-06) (clear pos-07-05)
   added: (at player-01 pos-08-06) (at stone-02 pos-07-05) (clear pos-09-07) (at-goal stone-02)
   goals met: 2 of 4
10. (move player-01 pos-08-06 pos-09-05 dir-northeast)
   deleted: (at player-01 pos-08-06) (clear pos-09-05)
   added: (at player-01 pos-09-05) (clear pos-08-06)
   goals met: 2 of 4
11. (push-to-nongoal player-01 stone-03 pos-09-05 pos-08-04 pos-07-03 dir-northwest)
   deleted: (at player-01 pos-09-05) (at stone-03 pos-08-04) (clear pos-07-03) (at-goal stone-03)
   added: (at player-01 pos-08-04) (at stone-03 pos-07-03) (clear pos-09-05)
   goals met: 1 of 4
12. (move player-01 pos-08-04 pos-06-04 dir-west)
   deleted: (at player-01 pos-08-04) (clear pos-06-04)
   added: (at player-01 pos-06-04) (clear pos-08-04)
   goals met: 1 of 4
13. (move player-01 pos-06-04 pos-05-05 dir-southwest)
   deleted: (at player-01 pos-06-04) (clear pos-05-05)
   added: (at player-01 pos-05-05) (clear pos-06-04)
   goals met: 1 of 4
14. (push-to-goal player-02 stone-03 pos-08-02 pos-07-03 pos-06-04 dir-southwest)
   deleted: (at player-02 pos-08-02) (at stone-03 pos-07-03) (clear pos-06-04)
   added: (at player-02 pos-07-03) (at stone-03 pos-06-04) (clear pos-08-02) (at-goal stone-03)
   goals met: 2 of 4
15. (move player-02 pos-07-03 pos-08-04 dir-southeast)
   deleted: (at player-02 pos-07-03) (clear pos-08-04)
   added: (at player-02 pos-08-04) (clear pos-07-03)
   goals met: 2 of 4
16. (move player-01 pos-05-05 pos-04-06 dir-southwest)
   deleted: (at player-01 pos-05-05) (clear pos-04-06)
   added: (at player-01 pos-04-06) (clear pos-05-05)
   goals met: 2 of 4
17. (move player-02 pos-08-04 pos-09-05 dir-southeast)
   deleted: (at player-02 pos-08-04) (clear pos-09-05)
   added: (at player-02 pos-09-05) (clear pos-08-04)
   goals met: 2 of 4
18. (push-to-nongoal player-02 stone-02 pos-09-05 pos-07-05 pos-05-05 dir-west)
   deleted: (at player-02 pos-09-05) (at stone-02 pos-07-05) (clear pos-05-05) (at-goal stone-02)
   added: (at player-02 pos-07-05) (at stone-02 pos-05-05) (clear pos-09-05)
   goals met: 1 of 4
19. (move player-02 pos-07-05 pos-08-06 dir-southeast)
   deleted: (at player-02 pos-07-05) (clear pos-08-06)
   added: (at player-02 pos-08-06) (clear pos-07-05)
   goals met: 1 of 4
20. (move player-02 pos-08-06 pos-09-07 dir-southeast)
   deleted: (at player-02 pos-08-06) (clear pos-09-07)
   added: (at player-02 pos-09-07) (clear pos-08-06)
   goals met: 1 of 4
21. (push-to-nongoal player-01 stone-01 pos-04-06 pos-06-06 pos-08-06 dir-east)
   deleted: (at player-01 pos-04-06) (at stone-01 pos-06-06) (clear pos-08-06)
   added: (at player-01 pos-06-06) (at stone-01 pos-08-06) (clear pos-04-06)
   goals met: 1 of 4
22. (move player-01 pos-06-06 pos-07-05 dir-northeast)
   deleted: (at player-01 pos-06-06) (clear pos-07-05)
   added: (at player-01 pos-07-05) (clear pos-06-06)
   goals met: 1 of 4
23. (move player-02 pos-09-07 pos-11-07 dir-east)
   deleted: (at player-02 pos-09-07) (clear pos-11-07)
   added: (at player-02 pos-11-07) (clear pos-09-07)
   goals met: 1 of 4
24. (push-to-nongoal player-02 stone-04 pos-11-07 pos-10-06 pos-09-05 dir-northwest)
   deleted: (at player-02 pos-11-07) (at stone-04 pos-10-06) (clear pos-09-05)
   added: (at player-02 pos-10-06) (at stone-04 pos-09-05) (clear pos-11-07)
   goals met: 1 of 4
25. (move player-01 pos-07-05 pos-08-04 dir-northeast)
   deleted: (at player-01 pos-07-05) (clear pos-08-04)
   added: (at player-01 pos-08-04) (clear pos-07-05)
   goals met: 1 of 4
26. (move player-01 pos-08-04 pos-07-03 dir-northwest)
   deleted: (at player-01 pos-08-04) (clear pos-07-03)
   added: (at player-01 pos-07-03) (clear pos-08-04)
   goals met: 1 of 4
27. (move player-01 pos-07-03 pos-05-03 dir-west)
   deleted: (at player-01 pos-07-03) (clear pos-05-03)
   added: (at player-01 pos-05-03) (clear pos-07-03)
   goals met: 1 of 4
28. (push-to-goal player-02 stone-04 pos-10-06 pos-09-05 pos-08-04 dir-northwest)
   deleted: (at player-02 pos-10-06) (at stone-04 pos-09-05) (clear pos-08-04)
   added: (at player-02 pos-09-05) (at stone-04 pos-08-04) (clear pos-10-06) (at-goal stone-04)
   goals met: 2 of 4
29. (move player-02 pos-09-05 pos-07-05 dir-west)
   deleted: (at player-02 pos-09-05) (clear pos-07-05)
   added: (at player-02 pos-07-05) (clear pos-09-05)
   goals met: 2 of 4
30. (push-to-goal player-02 stone-01 pos-07-05 pos-08-06 pos-09-07 dir-southeast)
   deleted: (at player-02 pos-07-05) (at stone-01 pos-08-06) (clear pos-09-07)
   added: (at player-02 pos-08-06) (at stone-01 pos-09-07) (clear pos-07-05) (at-goal stone-01)
   goals met: 3 of 4
31. (push-to-goal player-01 stone-03 pos-05-03 pos-06-04 pos-07-05 dir-southeast)
   deleted: (at player-01 pos-05-03) (at stone-03 pos-06-04) (clear pos-07-05)
   added: (at player-01 pos-06-04) (at stone-03 pos-07-05) (clear pos-05-03)
   goals met: 3 of 4
32. (move player-01 pos-06-04 pos-07-03 dir-northeast)
   deleted: (at player-01 pos-06-04) (clear pos-07-03)
   added: (at player-01 pos-07-03) (clear pos-06-04)
   goals met: 3 of 4
33. (move player-02 pos-08-06 pos-06-06 dir-west)
   deleted: (at player-02 pos-08-06) (clear pos-06-06)
   added: (at player-02 pos-06-06) (clear pos-08-06)
   goals met: 3 of 4
34. (move player-02 pos-06-06 pos-04-06 dir-west)
   deleted: (at player-02 pos-06-06) (clear pos-04-06)
   added: (at player-02 pos-04-06) (clear pos-06-06)
   goals met: 3 of 4
35. (push-to-goal player-02 stone-02 pos-04-06 pos-05-05 pos-06-04 dir-northeast)
   deleted: (at player-02 pos-04-06) (at stone-02 pos-05-05) (clear pos-06-04)
   added: (at player-02 pos-05-05) (at stone-02 pos-06-04) (clear pos-04-06) (at-goal stone-02)
   goals met: 4 of 4
